 [
    {
      "city": "Paris",
      "country": "France",
      "clues": [
        "This city is home to a famous tower that sparkles every night.",
        "Known as the 'City of Love' and a hub for fashion and art."
      ],
      "fun_fact": [
        "The Eiffel Tower was supposed to be dismantled after 20 years but was saved because it was useful for radio transmissions!",
        "Paris has only one stop sign in the entire city—most intersections rely on priority-to-the-right rules."
      ],
      "trivia": [
        "This city is famous for its croissants and macarons. Bon appétit!",
        "Paris was originally a Roman city called Lutetia."
      ]
    },
    {
      "city": "Tokyo",
      "country": "Japan",
      "clues": [
        "This city has the busiest pedestrian crossing in the world.",
        "You can visit an entire district dedicated to anime, manga, and gaming."
      ],
      "fun_fact": [
        "Tokyo was originally a small fishing village called Edo before becoming the bustling capital it is today!",
        "More than 14 million people live in Tokyo, making it one of the most populous cities in the world."
      ],
      "trivia": [
        "The city has over 160,000 restaurants, more than any other city in the world.",
        "Tokyo's subway system is so efficient that train delays of just a few minutes come with formal apologies."
      ]
    },
    {
      "city": "New York",
      "country": "USA",
      "clues": [
        "Home to a green statue gifted by France in the 1800s.",
        "Nicknamed 'The Big Apple' and known for its Broadway theaters."
      ],
      "fun_fact": [
        "The Statue of Liberty was originally a copper color before oxidizing to its iconic green patina.",
        "Times Square was once called Longacre Square before being renamed in 1904."
      ],
      "trivia": [
        "New York City has 468 subway stations, making it one of the most complex transit systems in the world.",
        "The Empire State Building has its own zip code: 10118."
      ]
    },
    {
      "city": "Rome",
      "country": "Italy",
      "clues": [
        "This city contains a country within its borders.",
        "Ancient gladiators once battled in an iconic oval amphitheater here."
      ],
      "fun_fact": [
        "The Trevi Fountain collects about €3,000 in coins every day, which are donated to charity.",
        "Romans built about 11 aqueducts that supplied the city with water, some of which are still in use today."
      ],
      "trivia": [
        "This city has more than 2,000 fountains, more than any other city in the world.",
        "The ancient Pantheon still has the world's largest unreinforced concrete dome, nearly 2,000 years after construction."
      ]
    },
    {
      "city": "London",
      "country": "United Kingdom",
      "clues": [
        "This city's famous clock tower is often incorrectly named after its bell.",
        "You can find the world's oldest underground railway system here."
      ],
      "fun_fact": [
        "Despite its reputation for rain, this city actually receives less annual rainfall than Rome, Sydney, and New York!",
        "The London Underground tunnels were used as air raid shelters during World War II."
      ],
      "trivia": [
        "Six ravens are kept at the Tower of London at all times; legend says if they leave, the kingdom will fall.",
        "The Queen's official residence here has 775 rooms, including 52 royal and guest bedrooms."
      ]
    },
    {
      "city": "Cairo",
      "country": "Egypt",
      "clues": [
        "This city sits near three iconic structures that form a perfect alignment with the stars of Orion's Belt.",
        "The world's oldest wonder of the ancient world stands on its outskirts."
      ],
      "fun_fact": [
        "The Great Pyramid nearby was the tallest man-made structure in the world for nearly 4,000 years.",
        "This city's name means 'The Victorious' in Arabic, though locals call it 'Masr' rather than its official name."
      ],
      "trivia": [
        "The Al-Azhar University here was founded in 970 CE and is one of the oldest universities still in operation.",
        "The Egyptian Museum contains over 120,000 artifacts, including Tutankhamun's golden mask."
      ]
    },
    {
      "city": "Sydney",
      "country": "Australia",
      "clues": [
        "This city's iconic performance venue resembles sailing ships or shells.",
        "Its famous coastal pool fills with ocean water but is protected from sharks."
      ],
      "fun_fact": [
        "The Sydney Harbour Bridge is nicknamed 'The Coathanger' because of its distinctive arch-based design.",
        "The Opera House roof is covered with over one million self-cleaning tiles."
      ],
      "trivia": [
        "This city's famous New Year's Eve fireworks display uses over 8 tons of fireworks.",
        "Bondi Beach lifeguards perform over 5,000 rescues each year at this city's famous beach."
      ]
    },
    {
      "city": "Rio de Janeiro",
      "country": "Brazil",
      "clues": [
        "A massive art deco statue with outstretched arms watches over this coastal city.",
        "It hosts the world's largest carnival celebration each year before Lent."
      ],
      "fun_fact": [
        "The famous Christ the Redeemer statue is struck by lightning several times a year and has special lightning rods in its fingers.",
        "The city's name means 'January River,' named when Portuguese explorers mistook the bay for a river mouth."
      ],
      "trivia": [
        "Despite being Brazil's most famous city, it's not the capital - that honor belongs to Brasília.",
        "Copacabana Beach is 2.5 miles long and features a distinctive black and white wave-patterned promenade."
      ]
    },
    {
      "city": "Barcelona",
      "country": "Spain",
      "clues": [
        "This city has a famous unfinished cathedral designed by an architect who died after being hit by a tram.",
        "Its most popular street is a mile-long pedestrian thoroughfare ending at the sea."
      ],
      "fun_fact": [
        "The Sagrada Família has been under construction since 1882 and isn't expected to be completed until 2026.",
        "This city is the only one in the world to receive a Royal Gold Medal for Architecture, which is normally given to individuals."
      ],
      "trivia": [
        "Antoni Gaudí's buildings here are so unique that seven of them are UNESCO World Heritage sites.",
        "FC Barcelona's stadium, Camp Nou, is the largest in Europe with a capacity of 99,354."
      ]
    },
    {
      "city": "Venice",
      "country": "Italy",
      "clues": [
        "This city has no roads, only canals and pedestrian pathways.",
        "Masked revelers fill the streets during its famous pre-Lent festival."
      ],
      "fun_fact": [
        "The entire city is built on wooden pilings that have not rotted because they're underwater without oxygen.",
        "Venice is sinking at a rate of 1-2 millimeters per year."
      ],
      "trivia": [
        "There are 417 bridges connecting the city's 118 small islands.",
        "In the 1600s, this city had around 10,000 masked 'professional courtesans' - which is why Venice's Carnival became notorious."
      ]
    },
    {
      "city": "Dubai",
      "country": "United Arab Emirates",
      "clues": [
        "This desert city contains the world's tallest building.",
        "It boasts an indoor ski resort despite summer temperatures exceeding 45°C (113°F)."
      ],
      "fun_fact": [
        "The police here drive supercars including Bugattis, Ferraris, and Lamborghinis.",
        "This city went from a small fishing village to global metropolis in just 50 years after oil was discovered."
      ],
      "trivia": [
        "The Burj Khalifa is so tall that residents on the upper floors must wait longer to break their fast during Ramadan, as they can still see the sun.",
        "This city has the world's largest choreographed fountain system, with water jets shooting up to 500 feet high."
      ]
    },
    {
      "city": "Istanbul",
      "country": "Turkey",
      "clues": [
        "This city straddles two continents with a strait running through its center.",
        "It has served as the capital of three major empires: Roman, Byzantine, and Ottoman."
      ],
      "fun_fact": [
        "The Grand Bazaar is one of the world's oldest and largest covered markets with over 4,000 shops.",
        "This city has been known by three different names throughout history: Byzantium, Constantinople, and its current name."
      ],
      "trivia": [
        "The Hagia Sophia has served as both a cathedral and a mosque over its 1,500-year history.",
        "The Basilica Cistern, built in the 6th century, can hold 80,000 cubic meters of water and features two mysterious Medusa head pillars."
      ]
    },
    {
      "city": "Kyoto",
      "country": "Japan",
      "clues": [
        "This city was spared from bombing in WWII due to its cultural significance.",
        "It's home to over 1,600 Buddhist temples and 400 Shinto shrines."
      ],
      "fun_fact": [
        "Kyoto was Japan's capital for over 1,000 years before Tokyo took that role.",
        "The name of this city is actually an anagram of Tokyo (Kyoto → Tokyo) when written in Japanese characters."
      ],
      "trivia": [
        "The Golden Pavilion (Kinkaku-ji) is covered in real gold leaf.",
        "Geisha tradition is still practiced in the historic Gion district of this city."
      ]
    },
    {
      "city": "Amsterdam",
      "country": "Netherlands",
      "clues": [
        "This city has more canals than Venice and more bridges than Paris.",
        "Famous for its narrow houses that lean forward slightly by design."
      ],
      "fun_fact": [
        "The houses lean forward intentionally to make it easier to move furniture up using the hoisting beams without hitting the façade.",
        "There are more bicycles than people in this city - approximately 880,000 bikes for 800,000 residents."
      ],
      "trivia": [
        "Most of the city sits below sea level on land reclaimed from the sea.",
        "The Anne Frank House is among the city's most visited museums, with over 1.2 million visitors annually."
      ]
    },
    {
      "city": "Marrakech",
      "country": "Morocco",
      "clues": [
        "The walls of this ancient city are painted in a distinctive color that matches its nickname.",
        "Its main square transforms into a massive open-air food market and entertainment venue each night."
      ],
      "fun_fact": [
        "The distinctive red walls that give this city its 'Red City' nickname get their color from clay and ochre pigment.",
        "The medina (old city) is so complex that many houses still don't have official addresses."
      ],
      "trivia": [
        "Jemaa el-Fnaa square has been designated by UNESCO as a 'Masterpiece of World Heritage.'",
        "The Majorelle Garden was owned by fashion designer Yves Saint Laurent, whose ashes were scattered there after his death."
      ]
    },
    {
      "city": "Bangkok",
      "country": "Thailand",
      "clues": [
        "This city's ceremonial name is the longest place name in the world at 168 characters.",
        "Locals call it 'Krung Thep,' which means 'City of Angels.'"
      ],
      "fun_fact": [
        "Until 1939, this country was known as Siam.",
        "Approximately 95% of the Thai population is Buddhist, and the city has over 400 temples."
      ],
      "trivia": [
        "This city is home to what is considered the world's largest open-air market, Chatuchak Weekend Market, with over 15,000 stalls.",
        "The full ceremonial name of Bangkok translates roughly to 'City of angels, great city of immortals, magnificent city of the nine gems...'"
      ]
    },
    {
      "city": "Prague",
      "country": "Czech Republic",
      "clues": [
        "This city is home to the largest ancient castle complex in the world.",
        "Its astronomical clock has been keeping time since 1410, making it the third-oldest in the world."
      ],
      "fun_fact": [
        "The Prague Castle covers an area of almost 70,000 square meters, holding the Guinness World Record for largest ancient castle.",
        "The city's famous Charles Bridge is built of egg yolks mixed into the mortar, which supposedly made it stronger."
      ],
      "trivia": [
        "Franz Kafka was born and lived most of his life in this city.",
        "The narrowest street in Prague is just 50 cm wide and has its own traffic light to prevent pedestrian collisions."
      ]
    },
    {
      "city": "Cape Town",
      "country": "South Africa",
      "clues": [
        "This city sits in the shadow of a flat-topped mountain that often has a 'tablecloth' of clouds.",
        "It's known for its colorful houses in the Bo-Kaap neighborhood."
      ],
      "fun_fact": [
        "Table Mountain is one of the oldest mountains in the world at approximately 600 million years old.",
        "The city has the world's highest commercial bungee jump from a bridge (216 meters)."
      ],
      "trivia": [
        "The prison on Robben Island, where Nelson Mandela was held for 18 years, is now a museum and World Heritage site.",
        "This was the first city outside Europe and North America to receive the title 'World Design Capital' in 2014."
      ]
    },
    {
      "city": "Santorini",
      "country": "Greece",
      "clues": [
        "This island destination's distinctive white and blue buildings cling to volcanic cliffs.",
        "The entire archipelago is actually a massive volcanic caldera partly submerged in the sea."
      ],
      "fun_fact": [
        "Many houses on this island are built into caves, keeping them naturally cool in summer and warm in winter.",
        "Some believe this island was the inspiration for the lost city of Atlantis myth."
      ],
      "trivia": [
        "The last major volcanic eruption here around 1600 BCE was one of the largest in recorded history.",
        "The beaches here come in unusual colors - black, red, and white - due to their volcanic origin."
      ]
    },
    {
      "city": "Jerusalem",
      "country": "Israel",
      "clues": [
        "This ancient city is considered holy by three major world religions.",
        "Its old city is divided into four distinct quarters."
      ],
      "fun_fact": [
        "This city has been destroyed and rebuilt at least 44 times throughout history.",
        "The Western Wall has notes with prayers and wishes tucked into its cracks by millions of visitors each year."
      ],
      "trivia": [
        "The Church of the Holy Sepulchre is managed by six different Christian denominations under a complex arrangement called the 'Status Quo.'",
        "Jerusalem Syndrome is a psychological phenomenon where visitors develop religious psychosis after visiting this city."
      ]
    },
    {
      "city": "Machu Picchu",
      "country": "Peru",
      "clues": [
        "This 'lost city' sits high in mountain clouds and was only revealed to the outside world in 1911.",
        "Despite its stone construction, no mortar was used between the perfectly fitted blocks."
      ],
      "fun_fact": [
        "The stones in the structures are so precisely cut that a knife blade cannot fit between them, even after hundreds of years.",
        "This site was built in the 15th century but abandoned just 100 years later when the empire fell to Spanish conquest."
      ],
      "trivia": [
        "The name means 'Old Peak' or 'Old Mountain' in the local Quechua language.",
        "The site includes over 100 separate staircases, most carved from a single block of stone."
      ]
    },
    {
      "city": "Hong Kong",
      "country": "China",
      "clues": [
        "This city has more skyscrapers than any other city in the world.",
        "Despite being one of the most densely populated places on Earth, over 70% of its territory is green space."
      ],
      "fun_fact": [
        "This city has the world's longest outdoor covered escalator system, stretching over 800 meters.",
        "Many local buildings don't have a 4th floor because the number 4 sounds like 'death' in Cantonese."
      ],
      "trivia": [
        "Victoria Harbour is home to the world's largest permanent light and sound show every night.",
        "This city uses a trolley system called 'ding dings' that has been operating since 1904."
      ]
    },
    {
      "city": "Petra",
      "country": "Jordan",
      "clues": [
        "This ancient 'rose city' is carved directly into pink sandstone cliffs.",
        "Visitors must walk through a narrow mile-long gorge to reach its most famous building."
      ],
      "fun_fact": [
        "Although famous for its Treasury building, this city contains over 800 monuments spread across 264 square kilometers.",
        "The site was unknown to the Western world until 1812 when a Swiss explorer disguised as a Bedouin discovered it."
      ],
      "trivia": [
        "This ancient city appeared in 'Indiana Jones and the Last Crusade' as the temple housing the Holy Grail.",
        "The Treasury (Al-Khazneh) was actually a royal tomb, not a treasure storehouse as its name suggests."
      ]
    },
    {
      "city": "San Francisco",
      "country": "USA",
      "clues": [
        "This city's iconic bridge was once the longest suspension bridge in the world.",
        "Its Victorian 'Painted Ladies' houses appear in countless photos with downtown in the background."
      ],
      "fun_fact": [
        "The cable cars are the only mobile National Historic Landmark in the world.",
        "Alcatraz prison, located on an island in the bay, never had a successful escape - though 36 prisoners tried in 14 attempts."
      ],
      "trivia": [
        "The Golden Gate Bridge's distinctive color is called 'International Orange' and was originally just a primer.",
        "This city's Chinatown is the oldest in North America and the largest Chinese enclave outside Asia."
      ]
    },
    {
      "city": "Havana",
      "country": "Cuba",
      "clues": [
        "This capital city is known for colorful vintage American cars from the 1950s.",
        "Its historic center is a UNESCO World Heritage site with colonial buildings and narrow streets."
      ],
      "fun_fact": [
        "Most of the classic cars were maintained for over 60 years due to trade restrictions that prevented importing new vehicles.",
        "This city's Capitol building is modeled after the U.S. Capitol but is actually slightly taller."
      ],
      "trivia": [
        "Ernest Hemingway lived near this city for 20 years and set 'The Old Man and the Sea' in its waters.",
        "The city has the only still-operating U.S. embassy that doesn't fly an American flag outside."
      ]
    },
    {
      "city": "St. Petersburg",
      "country": "Russia",
      "clues": [
        "This northern city experiences 'White Nights' when the sun barely sets in summer.",
        "It was founded by a tsar who wanted to create a 'window to Europe.'"
      ],
      "fun_fact": [
        "The city was built on 101 islands connected by over 340 bridges.",
        "The Winter Palace contains over 1,500 rooms and 117 staircases."
      ],
      "trivia": [
        "The Hermitage Museum houses over three million items, and it would take 11 years to view each item for just one minute.",
        "This city has changed its name three times: St. Petersburg, Petrograd, and Leningrad, before returning to its original name."
      ]
    },
    {
      "city": "Lisbon",
      "country": "Portugal",
      "clues": [
        "This city is built on seven hills and features iconic yellow trams navigating steep streets.",
        "A devastating earthquake destroyed most of it in 1755, leading to one of the first planned city reconstructions."
      ],
      "fun_fact": [
        "The Vasco da Gama Bridge spanning the Tagus River is the longest bridge in Europe at 17.2 kilometers.",
        "This city claims to be the oldest city in Western Europe, predating London, Paris, and Rome by centuries."
      ],
      "trivia": [
        "Pastéis de nata, the famous custard tarts, were originally created by monks at the Jerónimos Monastery.",
        "The traditional fado music genre originating here is on UNESCO's Intangible Cultural Heritage list."
      ]
    },
    {
      "city": "Vienna",
      "country": "Austria",
      "clues": [
        "This city has been ranked the world's most livable city multiple times and is famous for its coffeehouses.",
        "It was the imperial capital of a major European empire and home to many classical music composers."
      ],
      "fun_fact": [
        "The Spanish Riding School here has been training Lipizzaner horses in classical dressage for over 450 years.",
        "The ferris wheel in Prater park was one of the world's first and featured in the film 'The Third Man.'"
      ],
      "trivia": [
        "Mozart, Beethoven, Schubert, Strauss, and many other famous composers lived and worked in this city.",
        "Coffee culture is so important here that UNESCO has recognized it as intangible cultural heritage."
      ]
    },
    {
      "city": "Edinburgh",
      "country": "Scotland",
      "clues": [
        "This city's castle sits atop an extinct volcano.",
        "The world's largest arts festival is held here every August."
      ],
      "fun_fact": [
        "The city has 52 graveyards, many of which are said to be haunted.",
        "Underneath the Royal Mile lies a network of underground streets and chambers where people once lived."
      ],
      "trivia": [
        "J.K. Rowling wrote much of the Harry Potter series in cafes around this city, which inspired many locations in the books.",
        "The Royal Mile is actually 1.1 miles long, making it a 'Royal Mile and a bit.'"
      ]
    },
    {
      "city": "Dubrovnik",
      "country": "Croatia",
      "clues": [
        "This coastal city is completely encircled by massive stone walls overlooking the Adriatic Sea.",
        "A popular TV fantasy series filmed many scenes in its well-preserved medieval streets."
      ],
      "fun_fact": [
        "The city walls have never been breached in over 1,000 years of military conflicts.",
        "Lord Byron called this city the 'Pearl of the Adriatic.'"
      ],
      "trivia": [
        "This city served as King's Landing in the TV series 'Game of Thrones.'",
        "The main street, Stradun, is made of marble that has been polished by centuries of foot traffic until it's actually slippery."
      ]
    },
    {
      "city": "Buenos Aires",
      "country": "Argentina",
      "clues": [
        "This city is known as the 'Paris of South America' for its European architecture.",
        "It's the birthplace of tango, which you can see performed in milongas throughout the city."
      ],
      "fun_fact": [
        "The city has the widest avenue in the world, 9 de Julio Avenue, with up to 14 lanes.",
        "Residents typically eat dinner around 10 PM, and nightclubs don't get busy until 2 AM."
      ],
      "trivia": [
        "The Recoleta Cemetery contains elaborate mausoleums and is the resting place of Eva Perón.",
        "This city has more bookstores per person than any other city in the world."
      ]
    },
    {
      "city": "Moscow",
      "country": "Russia",
      "clues": [
        "This city's famous square has colorful onion domes nearby.",
        "Its metro stations look like underground palaces adorned with chandeliers and artwork."
      ],
      "fun_fact": [
        "The Kremlin walls were originally white, not red, until they were painted during Soviet times.",
        "Moscow's Metro carries 9 million passengers daily, more than London and New York's subways combined."
      ],
      "trivia": [
        "St. Basil's Cathedral was commissioned by Ivan the Terrible, who allegedly blinded the architects so they could never create anything more beautiful.",
        "The Lenin Library contains over 47 million items, making it one of the largest in the world."
      ]
    },
    {
      "city": "Seoul",
      "country": "South Korea",
      "clues": [
        "This Asian capital seamlessly blends ancient palaces with futuristic skyscrapers.",
        "It's surrounded by mountains and bisected by the Han River."
      ],
      "fun_fact": [
        "This city has the world's fastest average internet speed.",
        "There are over 33,000 convenience stores here - about one store for every 300 people."
      ],
      "trivia": [
        "The city was nearly completely destroyed during the Korean War but was rebuilt into an economic powerhouse in just a few decades.",
        "Gangnam, made famous by the song 'Gangnam Style,' is an actual district in this city known for wealth and high-end shopping."
      ]
    },
    {
      "city": "Florence",
      "country": "Italy",
      "clues": [
        "This city was the birthplace of the Renaissance and is home to Michelangelo's David.",
        "Its cathedral dome was the largest in the world when completed in the 15th century."
      ],
      "fun_fact": [
        "The Uffizi Gallery was never intended to be a museum; it was originally built as offices for magistrates.",
        "Around 600 people have yearly hospitalizations due to Stendhal Syndrome, a psychosomatic disorder caused by viewing too much beautiful art here."
      ],
      "trivia": [
        "The Medici family, who effectively ruled this city for centuries, produced four popes and two queens of France.",
        "The Ponte Vecchio bridge survived WWII because Hitler allegedly thought it too beautiful to destroy."
      ]
    },
    {
      "city": "Singapore",
      "country": "Singapore",
      "clues": [
        "This city-state features a hotel with an infinity pool on its boat-shaped rooftop.",
        "Chewing gum is banned in this meticulously clean metropolis."
      ],
      "fun_fact": [
        "This is one of only three city-states in the world.",
        "The national symbol is the Merlion, a mythical creature with a lion's head and fish body."
      ],
      "trivia": [
        "Gardens by the Bay contains 'supertrees' up to 16 stories tall that generate solar power and collect rainwater.",
        "This city has the world's first night safari zoo and one of the world's largest collections of orchids."
      ]
    },
    {
      "city": "Dubrovnik",
      "country": "Croatia",
      "clues": [
        "This coastal city is completely encircled by massive stone walls overlooking the Adriatic Sea.",
        "A popular TV fantasy series filmed many scenes in its well-preserved medieval streets."
      ],
      "fun_fact": [
        "The city walls have never been breached in over 1,000 years of military conflicts.",
        "Lord Byron called this city the 'Pearl of the Adriatic.'"
      ],
      "trivia": [
        "This city served as King's Landing in the TV series 'Game of Thrones.'",
        "The main street, Stradun, is made of marble that has been polished by centuries of foot traffic until it's actually slippery."
      ]
    },
    {
      "city": "Reykjavik",
      "country": "Iceland",
      "clues": [
        "This northerly capital city is heated almost entirely by geothermal energy.",
        "A striking concrete church dominates its skyline with a design inspired by basalt lava columns."
      ],
      "fun_fact": [
        "This is the world's northernmost capital of a sovereign state.",
        "You can see the northern lights from this city between September and April."
      ],
      "trivia": [
        "In 2010, residents elected a comedian as mayor after he promised not to fulfill any of his campaign promises.",
        "The city's name means 'Smoky Bay' due to the steam rising from its hot springs."
      ]
    },
    {
      "city": "Mexico City",
      "country": "Mexico",
      "clues": [
        "This massive capital is built on the ruins of an ancient lake city with floating gardens.",
        "It's sinking at a rate of about 10 inches per year as water is pumped from the aquifer below."
      ],
      "fun_fact": [
        "The city sits on the site of Tenochtitlan, the ancient Aztec capital built on an island in Lake Texcoco.",
        "The Basilica of Our Lady of Guadalupe here is the most visited Catholic site in the world after the Vatican."
      ],
      "trivia": [
        "The city has more museums than any other city in the world - over 150 official museums.",
        "The ancient Aztec calendar stone, weighing 24 tons, was discovered buried under the main square in 1790."
      ]
    },
    {
      "city": "Berlin",
      "country": "Germany",
      "clues": [
        "This city was divided by a notorious wall for 28 years.",
        "Its Brandenburg Gate was once a symbol of division but now represents unity."
      ],
      "fun_fact": [
        "This city has more bridges than Venice, with around 1,700 bridges spanning its rivers and canals.",
        "The longest remaining section of the Berlin Wall is now an open-air art gallery called the East Side Gallery."
      ],
      "trivia": [
        "The city has three UNESCO World Heritage opera houses within its boundaries.",
        "Tegel Airport was built in just 90 days during the Berlin Airlift to break the Soviet blockade."
      ]
    },
    {
      "city": "Agra",
      "country": "India",
      "clues": [
        "This city is home to a white marble mausoleum built by an emperor for his beloved wife.",
        "The iconic building appears to change color throughout the day with the shifting sunlight."
      ],
      "fun_fact": [
        "The Taj Mahal's four minarets are tilted slightly outward so that in the event of an earthquake, they would fall away from the main structure.",
        "It took over 22,000 workers and 1,000 elephants to build this city's most famous monument."
      ],
      "trivia": [
        "The Taj Mahal contains a spiritual optical illusion - the tomb inside appears larger as you get closer to it.",
        "The city was once the capital of the Mughal Empire during the 16th and 17th centuries."
      ]
    },
    {
      "city": "Varanasi",
      "country": "India",
      "clues": [
        "This ancient city on the banks of a sacred river is considered one of the oldest continuously inhabited places on Earth.",
        "Hindu pilgrims come to bathe in holy waters and cremate their loved ones on wooden pyres along the ghats."
      ],
      "fun_fact": [
        "Mark Twain once wrote: 'Benares (the old name for this city) is older than history, older than tradition, older even than legend, and looks twice as old as all of them put together.'",
        "This city is sacred to Hindus, Buddhists, and Jains, with Buddha said to have given his first sermon nearby."
      ],
      "trivia": [
        "Over 80 ghats (series of steps leading to the river) line the western bank of the Ganges River here.",
        "The evening Ganga Aarti ceremony involves priests performing rituals with fire as an offering to the river goddess."
      ]
    },
    {
      "city": "Marrakech",
      "country": "Morocco",
      "clues": [
        "The walls of this ancient city are painted in a distinctive color that matches its nickname.",
        "Its main square transforms into a massive open-air food market and entertainment venue each night."
      ],
      "fun_fact": [
        "The distinctive red walls that give this city its 'Red City' nickname get their color from clay and ochre pigment.",
        "The medina (old city) is so complex that many houses still don't have official addresses."
      ],
      "trivia": [
        "Jemaa el-Fnaa square has been designated by UNESCO as a 'Masterpiece of World Heritage.'",
        "The Majorelle Garden was owned by fashion designer Yves Saint Laurent, whose ashes were scattered there after his death."
      ]
    },
    {
      "city": "Cusco",
      "country": "Peru",
      "clues": [
        "This city sits at 3,400 meters above sea level and was once the capital of a mighty empire.",
        "Many buildings here have foundations built by ancient stonemasons with such precision that no mortar was needed."
      ],
      "fun_fact": [
        "The city was designed in the shape of a puma, with the nearby fortress of Sacsayhuamán forming the head.",
        "Local guides will show you walls where you cannot insert even a credit card between the massive stones."
      ],
      "trivia": [
        "This was the historic capital of the Inca Empire until the Spanish conquest in the 16th century.",
        "Coca tea is commonly offered to tourists here to help with altitude sickness."
      ]
    },
    {
      "city": "Melbourne",
      "country": "Australia",
      "clues": [
        "This city is known for its street art, café culture, and unpredictable weather.",
        "Its tram network is the largest outside of Europe and one route circles the central business district for free."
      ],
      "fun_fact": [
        "The city has been named the world's most livable city seven years in a row.",
        "Its residents consume more coffee per capita than in any other city in the world."
      ],
      "trivia": [
        "The Australian Open tennis tournament is held here every January.",
        "This city's Royal Exhibition Building was the first building in Australia to achieve UNESCO World Heritage status."
      ]
    },
    {
      "city": "Kathmandu",
      "country": "Nepal",
      "clues": [
        "This city sits in a valley surrounded by Himalayan mountains.",
        "Its Durbar Square contains temples and palaces dating back to the 12th century."
      ],
      "fun_fact": [
        "The city is home to the world's smallest living deity, the Kumari, a young girl believed to be the incarnation of goddess Taleju.",
        "Freak Street got its name in the 1960s and 70s when it was the final destination on the hippie trail."
      ],
      "trivia": [
        "Swayambhunath Temple here is nicknamed 'Monkey Temple' due to the holy monkeys living in its northwest parts.",
        "The city was severely damaged by a 7.8 magnitude earthquake in 2015, destroying many historic structures."
      ]
    },
    {
      "city": "Quebec City",
      "country": "Canada",
      "clues": [
        "This North American city has the only fortified city walls north of Mexico.",
        "A grand hotel here resembles a castle and is said to be the most photographed hotel in the world."
      ],
      "fun_fact": [
        "The historic district of this city is a UNESCO World Heritage site and the only walled city in North America north of Mexico.",
        "The city hosts the world's largest winter carnival, featuring impressive ice sculptures and a hotel made entirely of ice."
      ],
      "trivia": [
        "The Château Frontenac hotel holds the Guinness World Record for being the most photographed hotel in the world.",
        "This was the first French settlement in North America and celebrated its 400th anniversary in 2008."
      ]
    },
    {
      "city": "Athens",
      "country": "Greece",
      "clues": [
        "This city is named after the goddess of wisdom and has ruins of an ancient temple atop a prominent hill.",
        "It's considered the birthplace of democracy, philosophy, and the Olympic Games."
      ],
      "fun_fact": [
        "The Acropolis is made of Pentelic marble which appears to change color throughout the day from white to blue to gold.",
        "This is the oldest capital city in Europe, with a recorded history spanning over 3,400 years."
      ],
      "trivia": [
        "The Olympic flame for the modern Olympic Games is still lit using the sun's rays at the Temple of Hera in nearby Olympia.",
        "In ancient times, criminals were banished from this city through a process called 'ostracism,' where citizens would write names on pottery shards."
      ]
    },
    {
      "city": "St. Petersburg",
      "country": "Russia",
      "clues": [
        "This northern city experiences 'White Nights' when the sun barely sets in summer.",
        "It was founded by a tsar who wanted to create a 'window to Europe.'"
      ],
      "fun_fact": [
        "The city was built on 101 islands connected by over 340 bridges.",
        "The Winter Palace contains over 1,500 rooms and 117 staircases."
      ],
      "trivia": [
        "The Hermitage Museum houses over three million items, and it would take 11 years to view each item for just one minute.",
        "This city has changed its name three times: St. Petersburg, Petrograd, and Leningrad, before returning to its original name."
      ]
    },
    {
      "city": "Chichen Itza",
      "country": "Mexico",
      "clues": [
        "This ancient city features a pyramid that creates the illusion of a serpent descending its stairs during equinoxes.",
        "Its name means 'at the mouth of the well of the Itza people' referring to a sacred cenote nearby."
      ],
      "fun_fact": [
        "If you clap your hands at the base of the main pyramid, the echo resembles the call of the sacred quetzal bird.",
        "The main ball court here has amazing acoustics - a whisper at one end can be heard clearly at the other end 135 meters away."
      ],
      "trivia": [
        "The main pyramid has 365 steps, one for each day of the year in the Mayan calendar.",
        "The sacred cenote (natural sinkhole) here was used for human sacrifices to the rain god Chaac."
      ]
    },
    {
      "city": "Havana",
      "country": "Cuba",
      "clues": [
        "This capital city is known for colorful vintage American cars from the 1950s.",
        "Its historic center is a UNESCO World Heritage site with colonial buildings and narrow streets."
      ],
      "fun_fact": [
        "Most of the classic cars were maintained for over 60 years due to trade restrictions that prevented importing new vehicles.",
        "This city's Capitol building is modeled after the U.S. Capitol but is actually slightly taller."
      ],
      "trivia": [
        "Ernest Hemingway lived near this city for 20 years and set 'The Old Man and the Sea' in its waters.",
        "The city has the only still-operating U.S. embassy that doesn't fly an American flag outside."
      ]
    },
    {
      "city": "Bali",
      "country": "Indonesia",
      "clues": [
        "This island destination is known as the 'Island of the Gods' with thousands of temples.",
        "Rice terraces cascade down hillsides in the central highlands of this popular vacation spot."
      ],
      "fun_fact": [
        "The local calendar here has only 210 days, and everyone celebrates the New Year with a day of complete silence called Nyepi.",
        "This island follows a unique form of Hinduism that blends aspects of Buddhism, animism, and ancestor worship."
      ],
      "trivia": [
        "The Uluwatu Temple is guarded by monkeys who are known to steal visitors' belongings.",
        "Traditional dancers can enter trance states during performances where they are believed to be temporarily possessed by spirits."
      ]
    },
    {
      "city": "Dublin",
      "country": "Ireland",
      "clues": [
        "This city's most famous export is a dark stout beer brewed since 1759.",
        "A medieval book considered one of Ireland's national treasures is housed in its most prestigious university."
      ],
      "fun_fact": [
        "St. Patrick's Cathedral here is the tallest and largest church in Ireland.",
        "The iconic Ha'penny Bridge got its name from the toll originally charged to cross it - half a penny."
      ],
      "trivia": [
        "Trinity College houses the Book of Kells, a 1,200-year-old illuminated manuscript of the four Gospels.",
        "Literary giants James Joyce, Oscar Wilde, Samuel Beckett, and Bram Stoker were all born in this city."
      ]
    },
    {
      "city": "Easter Island",
      "country": "Chile",
      "clues": [
        "This remote island in the Pacific Ocean is famous for its nearly 1,000 monolithic stone statues.",
        "The native name of this place means 'navel of the world' due to its extreme isolation."
      ],
      "fun_fact": [
        "The moai statues weigh up to 86 tons and some were transported up to 18 kilometers from the quarry where they were carved.",
        "The island is one of the most remote inhabited places on Earth - the nearest inhabited land is Pitcairn Island, 2,075 km away."
      ],
      "trivia": [
        "The island's native Rapa Nui people developed a unique form of writing called Rongorongo, which has yet to be deciphered.",
        "Almost all the moai face inland, watching over the villages, with their backs to the sea."
      ]
    },
    {
      "city": "Petra",
      "country": "Jordan",
      "clues": [
        "This ancient 'rose city' is carved directly into pink sandstone cliffs.",
        "Visitors must walk through a narrow mile-long gorge to reach its most famous building."
      ],
      "fun_fact": [
        "Although famous for its Treasury building, this city contains over 800 monuments spread across 264 square kilometers.",
        "The site was unknown to the Western world until 1812 when a Swiss explorer disguised as a Bedouin discovered it."
      ],
      "trivia": [
        "This ancient city appeared in 'Indiana Jones and the Last Crusade' as the temple housing the Holy Grail.",
        "The Treasury (Al-Khazneh) was actually a royal tomb, not a treasure storehouse as its name suggests."
      ]
    },
    {
      "city": "Mumbai",
      "country": "India",
      "clues": [
        "This city's iconic harbor gateway was built during British colonial rule to commemorate a royal visit.",
        "It's home to the world's largest film industry, producing over 1,000 films annually."
      ],
      "fun_fact": [
        "This city was built on what was originally seven islands that were later connected through land reclamation.",
        "The world's largest open-air laundry, Dhobi Ghat, processes tons of clothing daily using traditional methods."
      ],
      "trivia": [
        "Bollywood got its name by combining this city's former name (Bombay) with Hollywood.",
        "The city's train system carries over 7.5 million passengers daily, making it one of the busiest in the world."
      ]
    },
    {
      "city": "New Orleans",
      "country": "USA",
      "clues": [
        "This city is known for its annual Mardi Gras celebration and distinctive French Creole architecture.",
        "Jazz music was born in this city, which sits mostly below sea level."
      ],
      "fun_fact": [
        "This city has more historic districts than any other city in America, with 20 historic districts.",
        "The above-ground cemeteries here are nicknamed 'Cities of the Dead' because the high water table prevents traditional burials."
      ],
      "trivia": [
        "Voodoo was once widely practiced here, with Marie Laveau being the most famous voodoo priestess.",
        "The cocktails Sazerac and Hurricane were both invented in this city's French Quarter."
      ]
    },
    {
      "city": "Angkor Wat",
      "country": "Cambodia",
      "clues": [
        "This massive religious complex is the largest temple in the world.",
        "It appears on the national flag of its country, the only world flag featuring a building."
      ],
      "fun_fact": [
        "The main temple is oriented toward the west instead of the east, which some scholars believe indicates it was dedicated to Vishnu, who is associated with the west.",
        "It took 35 years to build and required more stone than all the Egyptian pyramids combined."
      ],
      "trivia": [
        "The complex appears in the movie 'Tomb Raider' as the location where Lara Croft finds the Triangle of Light.",
        "Scientists using LIDAR technology recently discovered the ruins were part of a medieval city the size of modern-day Los Angeles."
      ]
    },
    {
      "city": "Copenhagen",
      "country": "Denmark",
      "clues": [
        "This city is home to a famous bronze statue of a mythical sea creature sitting on a rock by the waterfront.",
        "Its colorful harbor district was once a bustling port area and is now a popular tourist destination."
      ],
      "fun_fact": [
        "The Little Mermaid statue has been vandalized over 10 times, including having her head cut off twice.",
        "This is one of the most bike-friendly cities in the world with more bicycles than people."
      ],
      "trivia": [
        "Tivoli Gardens, opened in 1843, is one of the oldest operating amusement parks in the world and inspired Walt Disney.",
        "The city aims to be the world's first carbon-neutral capital by 2025."
      ]
    },
    {
      "city": "Fez",
      "country": "Morocco",
      "clues": [
        "This city's ancient medina contains the world's oldest university.",
        "Its tanneries use methods unchanged since medieval times, with colorful dye pits visible from surrounding terraces."
      ],
      "fun_fact": [
        "The medieval medina contains over 9,000 narrow streets and alleys, many too narrow for cars.",
        "Locals usually give visitors mint leaves to hold while visiting the tanneries to counter the strong smell."
      ],
      "trivia": [
        "University of Al Quaraouiyine, founded in 859 AD, is recognized by UNESCO as the oldest continuously operating university in the world.",
        "The city's name comes from the Arabic word for 'pickaxe,' the tool allegedly used to build its walls."
      ]
    },
    {
      "city": "Jaipur",
      "country": "India",
      "clues": [
        "Known as the 'Pink City,' its buildings were painted this color to welcome a royal visit in 1876.",
        "It features a palace of winds with 953 small windows designed to allow royal ladies to observe street life without being seen."
      ],
      "fun_fact": [
        "The city follows a grid plan based on ancient Hindu architecture principles, unusual for its time in India.",
        "The Jantar Mantar observatory here contains the world's largest stone sundial, accurate to within 2 seconds."
      ],
      "trivia": [
        "Hawa Mahal (Palace of Winds) is only one room deep in most places - it's essentially an elaborate façade.",
        "This city forms one point of India's popular tourist circuit known as the 'Golden Triangle.'"
      ]
    },
    {
      "city": "St. Moritz",
      "country": "Switzerland",
      "clues": [
        "This Alpine resort town has hosted the Winter Olympics twice.",
        "It's known for its mineral springs, which have attracted visitors for over 3,000 years."
      ],
      "fun_fact": [
        "The town has 322 days of sunshine per year, which is why its symbol is the sun.",
        "It pioneered winter tourism in the Alps when a hotelier made a bet with British guests that winter would be pleasant."
      ],
      "trivia": [
        "The Cresta Run toboggan course here has been rebuilt by hand every winter since 1884.",
        "This resort town invented the sport of bobsledding and built the world's first bobsled run."
      ]
    },
    {
      "city": "Casablanca",
      "country": "Morocco",
      "clues": [
        "Despite its fame from a classic Hollywood film, the movie was not actually filmed in this city.",
        "It's home to one of the largest mosques in the world, with a minaret reaching 210 meters high."
      ],
      "fun_fact": [
        "The Hassan II Mosque is built partly over the Atlantic Ocean, and its floor is made of glass so worshippers can see the sea below.",
        "Despite what the famous movie suggests, there was never a café called 'Rick's' in this city."
      ],
      "trivia": [
        "The city's name means 'white house' in Spanish, referring to the white-painted buildings visible from the sea.",
        "It's the largest city in the Maghreb region and a major economic center in Africa."
      ]
    },
    {
      "city": "Salzburg",
      "country": "Austria",
      "clues": [
        "This city's name means 'salt fortress' and it grew wealthy from the nearby salt mines.",
        "A famous musical family lived here, whose youngest member became a child prodigy and renowned composer."
      ],
      "fun_fact": [
        "Mozart was born here in 1756, and his birthplace is now one of the most visited museums in Austria.",
        "The film 'The Sound of Music' was set and filmed in this city and surrounding areas."
      ],
      "trivia": [
        "The Festung Hohensalzburg fortress is one of the largest medieval castles in Europe.",
        "The Salzburg Festival is one of the world's most prestigious music festivals, held every summer since 1920."
      ]
    },
    {
      "city": "Bucharest",
      "country": "Romania",
      "clues": [
        "This city has the world's heaviest building, which contains 1 million cubic meters of marble.",
        "It was once called 'Little Paris' due to its elegant architecture and tree-lined boulevards."
      ],
      "fun_fact": [
        "The Palace of the Parliament is the heaviest building in the world and the second-largest administrative building after the Pentagon.",
        "During the communist era, an entire historic district was demolished to build this massive structure."
      ],
      "trivia": [
        "The Romanian Athenaeum concert hall is depicted on the back of the lowest-denomination Romanian banknote.",
        "Vlad the Impaler (the inspiration for Dracula) established his court near this city in the 15th century."
      ]
    },
    {
      "city": "Alexandria",
      "country": "Egypt",
      "clues": [
        "This Mediterranean city was founded by a famous conqueror who gave it his name.",
        "It was once home to one of the Seven Wonders of the Ancient World that guided ships to safety."
      ],
      "fun_fact": [
        "The ancient library here was the largest in the world and was said to contain between 400,000 and 700,000 scrolls.",
        "The lighthouse (Pharos) stood approximately 450 feet tall and was one of the tallest man-made structures for many centuries."
      ],
      "trivia": [
        "Cleopatra, the last active ruler of the Ptolemaic Kingdom of Egypt, ruled from this city.",
        "Its ancient library has been reimagined as the modern Bibliotheca Alexandrina, opened in 2002."
      ]
    },
    {
      "city": "Monaco",
      "country": "Monaco",
      "clues": [
        "This tiny sovereign state on the French Riviera is the second-smallest country in the world.",
        "It's famous for its casino, Grand Prix street circuit, and harbor filled with luxury yachts."
      ],
      "fun_fact": [
        "This entire country is smaller than New York's Central Park.",
        "Residents of Monaco cannot gamble in the famous Monte Carlo Casino - only tourists are allowed to play."
      ],
      "trivia": [
        "Monaco has the highest density of millionaires and billionaires per capita in the world.",
        "The Formula 1 Grand Prix here is considered one of the most prestigious automobile races in the world."
      ]
    },
    {
      "city": "Shanghai",
      "country": "China",
      "clues": [
        "This city's waterfront promenade features iconic colonial-era buildings on one side and futuristic skyscrapers on the other.",
        "It's home to the world's second-tallest building, which looks like a giant bottle opener."
      ],
      "fun_fact": [
        "The city has more skyscrapers than New York City.",
        "The magnetic levitation train from the airport is the fastest commercial train in operation, reaching speeds of 431 km/h."
      ],
      "trivia": [
        "The Bund waterfront area features buildings in various architectural styles including Gothic, Baroque, and Art Deco.",
        "Shanghai Tower has the world's highest observation deck in a building at 562 meters above ground."
      ]
    },
    {
      "city": "Cartagena",
      "country": "Colombia",
      "clues": [
        "This colorful coastal city is surrounded by massive stone walls built to protect against pirates.",
        "The author Gabriel García Márquez set many of his stories in this Caribbean colonial city."
      ],
      "fun_fact": [
        "The city's fortifications took 200 years to complete and are the most extensive in South America.",
        "The walls are up to 20 meters thick in some places and withstood numerous pirate attacks."
      ],
      "trivia": [
        "The famous pirate Sir Francis Drake once held the city for ransom.",
        "Many scenes from the film 'Romancing the Stone' were supposed to be set here, though they were actually filmed in Mexico."
      ]
    },
    {
      "city": "Jerusalem",
      "country": "Israel",
      "clues": [
        "This ancient city is considered holy by three major world religions.",
        "Its old city is divided into four distinct quarters."
      ],
      "fun_fact": [
        "This city has been destroyed and rebuilt at least 44 times throughout history.",
        "The Western Wall has notes with prayers and wishes tucked into its cracks by millions of visitors each year."
      ],
      "trivia": [
        "The Church of the Holy Sepulchre is managed by six different Christian denominations under a complex arrangement called the 'Status Quo.'",
        "Jerusalem Syndrome is a psychological phenomenon where visitors develop religious psychosis after visiting this city."
      ]
    },
    {
      "city": "Abu Dhabi",
      "country": "United Arab Emirates",
      "clues": [
        "This city has a stunning white marble mosque that features 82 domes and can accommodate 40,000 worshippers.",
        "It's built on a T-shaped island and connected to the mainland by several bridges."
      ],
      "fun_fact": [
        "The Sheikh Zayed Grand Mosque contains the world's largest hand-knotted carpet, weighing 35 tons.",
        "Despite common belief, this city, not Dubai, is the capital of its country."
      ],
      "trivia": [
        "The Emirates Palace hotel here is covered with so much gold that it has a staff member whose only job is to touch up the gold leaf.",
        "Ferrari World on Yas Island contains the world's fastest roller coaster, which reaches speeds of 240 km/h."
      ]
    },
    {
      "city": "Dubrovnik",
      "country": "Croatia",
      "clues": [
        "This coastal city is completely encircled by massive stone walls overlooking the Adriatic Sea.",
        "A popular TV fantasy series filmed many scenes in its well-preserved medieval streets."
      ],
      "fun_fact": [
        "The city walls have never been breached in over 1,000 years of military conflicts.",
        "Lord Byron called this city the 'Pearl of the Adriatic.'"
      ],
      "trivia": [
        "This city served as King's Landing in the TV series 'Game of Thrones.'",
        "The main street, Stradun, is made of marble that has been polished by centuries of foot traffic until it's actually slippery."
      ]
    },
    {
      "city": "San Francisco",
      "country": "USA",
      "clues": [
        "This city's iconic bridge was once the longest suspension bridge in the world.",
        "Its Victorian 'Painted Ladies' houses appear in countless photos with downtown in the background."
      ],
      "fun_fact": [
        "The cable cars are the only mobile National Historic Landmark in the world.",
        "Alcatraz prison, located on an island in the bay, never had a successful escape - though 36 prisoners tried in 14 attempts."
      ],
      "trivia": [
        "The Golden Gate Bridge's distinctive color is called 'International Orange' and was originally just a primer.",
        "This city's Chinatown is the oldest in North America and the largest Chinese enclave outside Asia."
      ]
    },
    {
      "city": "Queenstown",
      "country": "New Zealand",
      "clues": [
        "This adventure capital is set on the shores of a Z-shaped lake surrounded by mountains named The Remarkables.",
        "The world's first commercial bungee jump was established near this adrenaline-seeker's paradise."
      ],
      "fun_fact": [
        "The town was named Queenstown because it was 'fit for Queen Victoria.'",
        "Parts of the Lord of the Rings trilogy were filmed in the landscapes surrounding this town."
      ],
      "trivia": [
        "Despite being famous for adventure sports, this town was originally founded during a gold rush in the 1860s.",
        "The world's first commercial jet boat company was established here in 1958."
      ]
    },
    {
      "city": "Beijing",
      "country": "China",
      "clues": [
        "This capital city has a palace complex with 9,999 rooms, just shy of what was believed to be the number of rooms in heaven.",
        "A massive defensive structure with watchtowers and battlements stretches thousands of miles from this city."
      ],
      "fun_fact": [
        "The Forbidden City is the largest palace complex in the world and was home to 24 emperors over 500 years.",
        "The Great Wall visible today was mostly built during the Ming Dynasty to protect this capital city."
      ],
      "trivia": [
        "The city has hosted both Summer and Winter Olympic Games, the only city to do so.",
        "The Temple of Heaven has perfect acoustics - you can hear a whisper from one end to the other, 35 meters away."
      ]
    },
    {
      "city": "Dublin",
      "country": "Ireland",
      "clues": [
        "This city's most famous export is a dark stout beer brewed since 1759.",
        "A medieval book considered one of Ireland's national treasures is housed in its most prestigious university."
      ],
      "fun_fact": [
        "St. Patrick's Cathedral here is the tallest and largest church in Ireland.",
        "The iconic Ha'penny Bridge got its name from the toll originally charged to cross it - half a penny."
      ],
      "trivia": [
        "Trinity College houses the Book of Kells, a 1,200-year-old illuminated manuscript of the four Gospels.",
        "Literary giants James Joyce, Oscar Wilde, Samuel Beckett, and Bram Stoker were all born in this city."
      ]
    },
    {
      "city": "Krakow",
      "country": "Poland",
      "clues": [
        "This city's Old Town survived WWII largely undamaged and features Europe's largest medieval market square.",
        "A legendary dragon once lived in a cave beneath the royal castle on the banks of the Vistula River."
      ],
      "fun_fact": [
        "Every hour, a trumpeter plays a melody from the tallest tower of St. Mary's Basilica, abruptly stopping mid-note to commemorate a 13th-century trumpeter who was shot in the throat while warning the city of a Mongol invasion.",
        "During the Nazi occupation, a Polish pharmacist ran an underground resistance network from his pharmacy in the Jewish ghetto."
      ],
      "trivia": [
        "This city was the capital of Poland until 1596 when King Sigismund III moved the court to Warsaw.",
        "The Wieliczka Salt Mine nearby features an entire chapel carved from salt, including chandeliers made of salt crystals."
      ]
    },
    {
      "city": "Vancouver",
      "country": "Canada",
      "clues": [
        "This coastal city is nestled between mountains and the Pacific Ocean, where you can ski and sail on the same day.",
        "A massive urban park here is larger than New York's Central Park and features a 5.5-mile seawall path."
      ],
      "fun_fact": [
        "Stanley Park is 10% larger than New York's Central Park and was named 'top park in the entire world' by TripAdvisor.",
        "This city has the longest uninterrupted waterfront path in the world at 28 km (17.5 miles)."
      ],
      "trivia": [
        "Greenpeace was founded in this city in 1971.",
        "Due to its temperate climate and scenic backdrop, it's nicknamed 'Hollywood North' because so many movies and TV shows are filmed here."
      ]
    },
    {
      "city": "Bruges",
      "country": "Belgium",
      "clues": [
        "This medieval city is crisscrossed by canals, earning it the nickname 'Venice of the North.'",
        "Its historic center remains largely unchanged since the Middle Ages and is a UNESCO World Heritage site."
      ],
      "fun_fact": [
        "The city has more than 80 bridges, and some date back to medieval times.",
        "The belfry houses a carillon with 47 bells that still requires a full-time carillonneur to play it."
      ],
      "trivia": [
        "The 2008 dark comedy film 'In Bruges' helped boost tourism to this picturesque city.",
        "It's famous for Belgian chocolate, with more than 50 chocolate shops in the small city center."
      ]
    },
    {
      "city": "Oslo",
      "country": "Norway",
      "clues": [
        "This Scandinavian capital is surrounded by forests and fjords, with a famous ski jump overlooking the city.",
        "The Nobel Peace Prize is awarded here every year."
      ],
      "fun_fact": [
        "The city gives an annual Christmas tree to London as thanks for British support during WWII.",
        "Viking ships over 1,000 years old are preserved in excellent condition at the city's museum."
      ],
      "trivia": [
        "The Holmenkollen ski jump offers panoramic views of the entire city and fjord.",
        "Edvard Munch's famous painting 'The Scream' is displayed at the National Gallery here."
      ]
    },
    {
      "city": "Helsinki",
      "country": "Finland",
      "clues": [
        "This Baltic capital is built on a peninsula and archipelago of 315 islands.",
        "It's known for its design district and unusual church carved into solid rock."
      ],
      "fun_fact": [
        "The city hosts the World Air Guitar Championships annually.",
        "There's an underground swimming pool built in a bomb shelter from WWII."
      ],
      "trivia": [
        "The Temppeliaukio Church is excavated directly into solid granite with a copper dome ceiling.",
        "Helsinki was chosen as the World Design Capital in 2012."
      ]
    },
    {
      "city": "Stockholm",
      "country": "Sweden",
      "clues": [
        "This city is built on 14 islands connected by 57 bridges.",
        "The Nobel Prize banquet is held in its City Hall's Blue Hall (which is actually red)."
      ],
      "fun_fact": [
        "The Vasa Museum displays an almost fully intact 17th-century warship that sank on its maiden voyage.",
        "There's a hotel made entirely of ice that's rebuilt every winter."
      ],
      "trivia": [
        "Stockholm's metro system is called the world's longest art gallery with murals and installations in 90 of 100 stations.",
        "The city has a law allowing people to pick flowers, mushrooms and berries anywhere, even on private property."
      ]
    },
    {
      "city": "Reykjavik",
      "country": "Iceland",
      "clues": [
        "This northerly capital city is heated almost entirely by geothermal energy.",
        "A striking concrete church dominates its skyline with a design inspired by basalt lava columns."
      ],
      "fun_fact": [
        "This is the world's northernmost capital of a sovereign state.",
        "You can see the northern lights from this city between September and April."
      ],
      "trivia": [
        "In 2010, residents elected a comedian as mayor after he promised not to fulfill any of his campaign promises.",
        "The city's name means 'Smoky Bay' due to the steam rising from its hot springs."
      ]
    },
    {
      "city": "Tallinn",
      "country": "Estonia",
      "clues": [
        "This medieval Baltic capital has one of Europe's best preserved Old Towns.",
        "It's considered the birthplace of Skype and has free public WiFi everywhere."
      ],
      "fun_fact": [
        "The city walls have 26 defensive towers, each with a unique name like 'Fat Margaret' and 'Kiek in de Kök.'",
        "This was the first country to allow online voting in national elections."
      ],
      "trivia": [
        "The Old Town has the world's oldest continuously operating pharmacy (since 1422).",
        "Christmas trees were first displayed in public here in 1441."
      ]
    },
    {
      "city": "Riga",
      "country": "Latvia",
      "clues": [
        "This Baltic capital has the finest collection of Art Nouveau architecture in Europe.",
        "Its Central Market occupies five former German Zeppelin hangars."
      ],
      "fun_fact": [
        "The city's Christmas tree tradition dates back to 1510, making it one of the first in Europe.",
        "Riga Black Balsam, a traditional herbal liqueur, was once prescribed as medicine by Catherine the Great."
      ],
      "trivia": [
        "The Freedom Monument has stood since 1935 despite multiple foreign occupations.",
        "Riga was the European Capital of Culture in 2014."
      ]
    },
    {
      "city": "Vilnius",
      "country": "Lithuania",
      "clues": [
        "This Baroque city has one of Europe's largest medieval Old Towns.",
        "It contains a self-declared independent artistic 'republic' called Užupis with its own constitution."
      ],
      "fun_fact": [
        "The city's university, founded in 1579, has a courtyard where you can whisper into one corner and be heard in the opposite corner.",
        "Vilnius was the European Capital of Culture in 2009."
      ],
      "trivia": [
        "The Chapel of Gates of Dawn contains a famous painting of the Virgin Mary said to have miraculous powers.",
        "Lithuania was the last pagan country in Europe, converting to Christianity in 1387."
      ]
    },
    {
      "city": "Warsaw",
      "country": "Poland",
      "clues": [
        "This city was almost completely destroyed in WWII but meticulously rebuilt its Old Town from paintings.",
        "A mermaid holding a sword and shield is its official symbol."
      ],
      "fun_fact": [
        "The reconstructed Old Town was added to UNESCO's World Heritage list as an example of near-total reconstruction.",
        "Warsaw has the tallest building in the EU - the Varso Tower at 310 meters."
      ],
      "trivia": [
        "Frederic Chopin's heart is entombed in a church pillar here while his body rests in Paris.",
        "The city has over 100 parks, giving it the nickname 'The Green City.'"
      ]
    },
    {
      "city": "Budapest",
      "country": "Hungary",
      "clues": [
        "This city was formed when two towns on opposite banks of the Danube united in 1873.",
        "Its thermal baths date back to Roman times, with some fed by natural hot springs."
      ],
      "fun_fact": [
        "The Parliament building contains the Hungarian Crown Jewels and uses 40 kilograms of 23-carat gold for decoration.",
        "Budapest has the largest synagogue in Europe and second largest in the world."
      ],
      "trivia": [
        "The city's metro line M1 is the second oldest underground railway in the world after London.",
        "Heroes' Square features statues of the seven tribal chiefs who founded Hungary in 896 AD."
      ]
    },
    {
      "city": "Bratislava",
      "country": "Slovakia",
      "clues": [
        "This capital is the only one bordering two other countries (Austria and Hungary).",
        "Its castle sits on a hill where four countries can be seen on a clear day."
      ],
      "fun_fact": [
        "For nearly 300 years, this city was the coronation site for Hungarian kings and queens.",
        "It's home to the world's only upside-down pyramid-shaped building (Slovak Radio Building)."
      ],
      "trivia": [
        "The narrowest house in Europe is here at just 130 cm wide.",
        "The city was called Pressburg when it was part of the Austro-Hungarian Empire."
      ]
    },
    {
      "city": "Ljubljana",
      "country": "Slovenia",
      "clues": [
        "This green capital has car-free zones throughout its center and a famous dragon bridge.",
        "Its castle sits on a hill above the old town, accessible by a funicular railway."
      ],
      "fun_fact": [
        "The city was named European Green Capital in 2016 for its sustainability efforts.",
        "The Triple Bridge is actually three bridges connecting the medieval town to the modern city."
      ],
      "trivia": [
        "Architect Jože Plečnick redesigned much of the city in the early 20th century, blending classical and modernist styles.",
        "The city's name comes from the Slovenian word 'ljubljena' meaning 'beloved.'"
      ]
    },
    {
      "city": "Zagreb",
      "country": "Croatia",
      "clues": [
        "This Central European capital has an Upper Town with medieval towers and a Lower Town with Austro-Hungarian architecture.",
        "Its quirky Museum of Broken Relationships displays mementos from failed relationships worldwide."
      ],
      "fun_fact": [
        "The city has the shortest funicular in the world at just 66 meters long.",
        "Zagreb was the first city in the world to have a hydroelectric power plant (in 1907)."
      ],
      "trivia": [
        "The Lotrščak Tower fires a cannon every day at noon, a tradition since 1877.",
        "St. Mark's Church has a colorful tiled roof displaying the medieval coat of arms of Croatia, Dalmatia and Slavonia."
      ]
    },
    {
      "city": "Sarajevo",
      "country": "Bosnia and Herzegovina",
      "clues": [
        "This city where East meets West was the site of Archduke Franz Ferdinand's assassination that sparked WWI.",
        "It hosted the 1984 Winter Olympics before being besieged in the 1990s Yugoslav Wars."
      ],
      "fun_fact": [
        "The Sarajevo Roses are concrete scars from mortar explosions filled with red resin as memorials.",
        "This is one of few cities with a mosque, Catholic church, Orthodox church and synagogue within walking distance."
      ],
      "trivia": [
        "The Latin Bridge over the Miljacka River is where Gavrilo Princip shot the Archduke in 1914.",
        "Sarajevo's old bazaar, Baščaršija, dates back to the 15th century Ottoman era."
      ]
    },
    {
      "city": "Belgrade",
      "country": "Serbia",
      "clues": [
        "This city at the confluence of the Danube and Sava rivers has been destroyed and rebuilt 44 times.",
        "Its fortress has been fought over by Celts, Romans, Byzantines, Hungarians, Ottomans and Austrians."
      ],
      "fun_fact": [
        "The city's name means 'White City' in Serbian.",
        "Belgrade has one of the best nightlife scenes in Europe, with floating clubs called 'splavovi' on the rivers."
      ],
      "trivia": [
        "The Temple of Saint Sava is one of the largest Orthodox churches in the world.",
        "Kalemegdan Fortress offers panoramic views where you can see the rivers' different colored waters merging."
      ]
    },
    {
      "city": "Sofia",
      "country": "Bulgaria",
      "clues": [
        "This capital at the foot of Vitosha Mountain has Roman ruins next to Soviet-era buildings.",
        "Its gold-domed Alexander Nevsky Cathedral can hold 10,000 worshippers."
      ],
      "fun_fact": [
        "The city has been inhabited for over 7,000 years, making it one of Europe's oldest continuously populated cities.",
        "You can drink mineral water from public fountains fed by natural hot springs under the city."
      ],
      "trivia": [
        "The Church of St. George is a 4th-century red brick rotunda with medieval frescoes.",
        "Sofia was named after the Hagia Sophia church, meaning 'Holy Wisdom' in Greek."
      ]
    },
    {
      "city": "Bucharest",
      "country": "Romania",
      "clues": [
        "This city has the world's heaviest building, which contains 1 million cubic meters of marble.",
        "It was once called 'Little Paris' due to its elegant architecture and tree-lined boulevards."
      ],
      "fun_fact": [
        "The Palace of the Parliament is the heaviest building in the world and the second-largest administrative building after the Pentagon.",
        "During the communist era, an entire historic district was demolished to build this massive structure."
      ],
      "trivia": [
        "The Romanian Athenaeum concert hall is depicted on the back of the lowest-denomination Romanian banknote.",
        "Vlad the Impaler (the inspiration for Dracula) established his court near this city in the 15th century."
      ]
    },
    {
      "city": "Tbilisi",
      "country": "Georgia",
      "clues": [
        "This city's name comes from the Georgian word for 'warm,' referring to its sulfur hot springs.",
        "Its old town features colorful wooden houses with carved balconies overlooking the Mtkvari River."
      ],
      "fun_fact": [
        "The city was founded in the 5th century when King Vakhtang Gorgasali's falcon fell into a hot spring and was cooked.",
        "The Narikala Fortress offers panoramic views and can be reached by cable car."
      ],
      "trivia": [
        "The Peace Bridge is a modern glass and steel pedestrian bridge illuminated by thousands of LEDs at night.",
        "Tbilisi's sulfur baths district has been in operation since the 12th century."
      ]
    },
    {
      "city": "Yerevan",
      "country": "Armenia",
      "clues": [
        "This pink city is built with volcanic tuff stone that glows in the sunset.",
        "It's one of the world's oldest continuously inhabited cities, founded in 782 BC."
      ],
      "fun_fact": [
        "The city has a cascading complex called the Cascade with 572 steps leading to panoramic views of Mount Ararat.",
        "Yerevan was the first city in the world to adopt Christianity as its official religion in 301 AD."
      ],
      "trivia": [
        "The Matenadaran museum houses one of the world's richest collections of medieval manuscripts.",
        "Armenian brandy produced here was reportedly Winston Churchill's favorite drink."
      ]
    },
    {
      "city": "Baku",
      "country": "Azerbaijan",
      "clues": [
        "This oil-rich capital on the Caspian Sea combines medieval walls with futuristic flame towers.",
        "It's home to the world's first oil well and first offshore oil platform."
      ],
      "fun_fact": [
        "The city is nicknamed the 'City of Winds' due to the strong winds blowing through it.",
        "Baku's Heydar Aliyev Center was designed by Zaha Hadid and is considered an architectural masterpiece."
      ],
      "trivia": [
        "The Old City contains the Maiden Tower, whose original purpose remains a mystery.",
        "Baku hosted the first European Games in 2015 and Formula 1 races since 2016."
      ]
    },
    {
      "city": "Tashkent",
      "country": "Uzbekistan",
      "clues": [
        "This Central Asian capital was rebuilt after a 1966 earthquake with wide boulevards and Soviet modernist architecture.",
        "It's home to one of the world's oldest Qurans, dating back to the 7th century."
      ],
      "fun_fact": [
        "The city has an entire metro system where each station is uniquely decorated with national motifs.",
        "Tashkent means 'Stone City' in Turkic languages."
      ],
      "trivia": [
        "The Khast Imam complex houses the Uthman Quran, said to have the blood of Caliph Uthman on its pages.",
        "Tashkent was an important stop on the ancient Silk Road trade route."
      ]
    },
    {
      "city": "Astana",
      "country": "Kazakhstan",
      "clues": [
        "This futuristic capital was built from scratch in the steppe and renamed Nur-Sultan in 2019.",
        "Its skyline features avant-garde architecture like a giant glass tent and a gold-leaf tower."
      ],
      "fun_fact": [
        "The city was purpose-built to be the capital in the 1990s, with temperatures ranging from -40°C in winter to +40°C in summer.",
        "The Bayterek Tower's observation deck has a golden handprint of Kazakhstan's first president."
      ],
      "trivia": [
        "The Khan Shatyr Entertainment Center is the world's largest tent structure.",
        "Astana hosted Expo 2017 on future energy with the theme 'Energy of the Future.'"
      ]
    },
    {
      "city": "Ulaanbaatar",
      "country": "Mongolia",
      "clues": [
        "This is the world's coldest capital city, with January temperatures averaging -25°C.",
        "Nearly half of Mongolia's population lives here, in Soviet-style apartment blocks or traditional gers (yurts)."
      ],
      "fun_fact": [
        "The city's name means 'Red Hero' in Mongolian.",
        "Ulaanbaatar has the worst air pollution of any capital city during winter due to coal burning."
      ],
      "trivia": [
        "The Gandantegchinlen Monastery has a 26.5-meter-high statue of Avalokitesvara covered in gold and jewels.",
        "The Winter Palace of the Bogd Khan is now a museum displaying the last monarch's possessions."
      ]
    },
    {
      "city": "Seville",
      "country": "Spain",
      "clues": [
        "This Andalusian city is home to the world's largest Gothic cathedral and a Moorish palace with intricate plasterwork.",
        "Flamenco dancing and bullfighting are important parts of its cultural heritage."
      ],
      "fun_fact": [
        "The cathedral contains Christopher Columbus's tomb and has an orange tree courtyard.",
        "The Giralda bell tower was originally a minaret from the 12th century mosque."
      ],
      "trivia": [
        "The Plaza de España was built for the 1929 Ibero-American Exposition and features tiled alcoves representing Spanish provinces.",
        "Seville's April Fair is one of Spain's most colorful festivals with flamenco, horses and traditional costumes."
      ]
    },
    {
      "city": "Valencia",
      "country": "Spain",
      "clues": [
        "This Mediterranean city is home to the futuristic City of Arts and Sciences complex.",
        "The traditional dish paella originated in its rural outskirts."
      ],
      "fun_fact": [
        "The Turia River was diverted after a 1957 flood, leaving the dry riverbed as a 9km-long park through the city.",
        "Valencia is the birthplace of the Holy Grail - the chalice in its cathedral matches historical descriptions."
      ],
      "trivia": [
        "Las Fallas festival in March features giant papier-mâché sculptures that are burned in spectacular bonfires.",
        "The Oceanogràfic is Europe's largest aquarium, with buildings shaped like water lilies."
      ]
    },
    {
      "city": "Porto",
      "country": "Portugal",
      "clues": [
        "This hilly city on the Douro River gives its name to port wine, aged in cellars across the river in Vila Nova de Gaia.",
        "Its historic center is a UNESCO site with azulejo-tiled buildings and the ornate Livraria Lello bookstore."
      ],
      "fun_fact": [
        "The Dom Luís I Bridge was designed by a student of Gustave Eiffel and resembles the Eiffel Tower on its side.",
        "Porto's football club FC Porto has a dragon on its crest representing the city's connection to Henry the Navigator."
      ],
      "trivia": [
        "The Clérigos Tower was Portugal's tallest structure when built in 1763 and offers panoramic views.",
        "J.K. Rowling lived in Porto in the 1990s and the university's black-robed students may have inspired Hogwarts uniforms."
      ]
    },
    {
      "city": "Nice",
      "country": "France",
      "clues": [
        "This French Riviera city has a pebbly beachfront promenade called the Promenade des Anglais.",
        "Its old town features Italianate baroque churches and a famous flower market."
      ],
      "fun_fact": [
        "Nice was part of Italy until 1860 when a plebiscite made it French.",
        "The city's airport is built on an artificial peninsula extending into the Mediterranean."
      ],
      "trivia": [
        "The Colline du Château (Castle Hill) offers the best views despite no longer having a castle.",
        "Salade Niçoise and ratatouille are local specialties from this city."
      ]
    },
    {
      "city": "Marseille",
      "country": "France",
      "clues": [
        "France's oldest city was founded by Greek sailors in 600 BC as Massalia.",
        "Its hilltop basilica Notre-Dame de la Garde offers panoramic views of the Mediterranean and islands."
      ],
      "fun_fact": [
        "Bouillabaisse fish stew originated here as a cheap meal for fishermen using unsold fish.",
        "The Calanques are dramatic limestone cliffs and fjords perfect for hiking and swimming."
      ],
      "trivia": [
        "Le Panier is the oldest neighborhood, with narrow streets and pastel-colored houses.",
        "Marseille was European Capital of Culture in 2013, sparking major urban renewal projects."
      ]
    },
    {
      "city": "Lyon",
      "country": "France",
      "clues": [
        "This gastronomic capital at the confluence of the Rhône and Saône rivers is known for its traboules (hidden passageways).",
        "Its silk industry history is preserved in the Musée des Tissus and Croix-Rousse district."
      ],
      "fun_fact": [
        "The Fête des Lumières in December sees the entire city illuminated with light installations.",
        "Lyon has more Michelin-starred restaurants than any city except Tokyo."
      ],
      "trivia": [
        "The Roman theaters on Fourvière Hill are among France's best preserved ancient sites.",
        "The Lumière brothers, inventors of cinema, filmed their first movies here in 1895."
      ]
    },
    {
      "city": "Toulouse",
      "country": "France",
      "clues": [
        "This 'Pink City' gets its nickname from the terracotta bricks used in most buildings.",
        "It's the European aerospace capital, home to Airbus and the Aeroscopia museum."
      ],
      "fun_fact": [
        "Toulouse was the capital of the Visigothic kingdom in the 5th century.",
        "The Cité de l'Espace theme park has full-scale models of Ariane rockets and the Mir space station."
      ],
      "trivia": [
        "The Basilica of Saint-Sernin is the largest remaining Romanesque building in Europe.",
        "Cassoulet, a rich bean and meat stew, is the city's signature dish."
      ]
    },
    {
      "city": "Bordeaux",
      "country": "France",
      "clues": [
        "This port city on the Garonne River gives its name to the famous wine region surrounding it.",
        "Its 18th-century golden stone architecture earned it UNESCO status as 'an outstanding urban ensemble.'"
      ],
      "fun_fact": [
        "The city has the largest reflecting water mirror in the world at 3,450 square meters.",
        "Bordeaux's wine trade made it so wealthy that the stock exchange was modeled after Versailles."
      ],
      "trivia": [
        "The Cité du Vin wine museum is shaped like a decanter with swirling glass and aluminum curves.",
        "Bordeaux has more protected historical buildings than any French city except Paris."
      ]
    },
    {
      "city": "Lille",
      "country": "France",
      "clues": [
        "This northern city near the Belgian border has Flemish influences in its architecture and cuisine.",
        "Its annual Braderie flea market is Europe's largest, attracting 2-3 million visitors."
      ],
      "fun_fact": [
        "Lille was the first French city liberated by British troops in WWI in 1918.",
        "The city's belfry is the tallest in France at 104 meters high."
      ],
      "trivia": [
        "The Palais des Beaux-Arts is France's second-largest art museum after the Louvre.",
        "Moules-frites (mussels and fries) is a local specialty reflecting Flemish culinary traditions."
      ]
    },
    {
      "city": "Strasbourg",
      "country": "France",
      "clues": [
        "This Alsatian city on the German border hosts the European Parliament and has a picturesque 'Petite France' district.",
        "Its Gothic cathedral with a single spire was the world's tallest building for over 200 years."
      ],
      "fun_fact": [
        "Strasbourg's historic center is on an island between two arms of the Ill River.",
        "The city changes hands between France and Germany four times between 1870-1945."
      ],
      "trivia": [
        "The Christmas market here dates back to 1570, making it one of the oldest in Europe.",
        "Strasbourg is the capital of both the Alsace region and the European Union."
      ]
    },
    {
      "city": "Montpellier",
      "country": "France",
      "clues": [
        "This southern French city has one of Europe's oldest medical schools, founded in 1220.",
        "Its modern Antigone district was designed to resemble neoclassical architecture."
      ],
      "fun_fact": [
        "Montpellier is France's fastest-growing city over the past 25 years.",
        "The city has no Roman ruins because it was founded in the 10th century - late by French standards."
      ],
      "trivia": [
        "The Place de la Comédie is nicknamed 'The Egg' for its oval shape.",
        "Montpellier's university has over 70,000 students, making it one of France's largest student cities."
      ]
    },
    {
      "city": "Nantes",
      "country": "France",
      "clues": [
        "This former Breton capital on the Loire River is known for Jules Verne (born here) and its mechanical elephant.",
        "The Edict of Nantes granting religious freedom to Protestants was signed here in 1598."
      ],
      "fun_fact": [
        "The Machines de l'Île features a 12-meter-high mechanical elephant that sprays water from its trunk.",
        "Nantes was ranked as France's most livable city multiple times in the 2010s."
      ],
      "trivia": [
        "The Château des Ducs de Bretagne was home to Anne of Brittany, twice queen of France.",
        "Nantes' LU Tower biscuit factory is now an art space with a rooftop view of the city."
      ]
    },
    {
      "city": "Rennes",
      "country": "France",
      "clues": [
        "This Breton capital has half-timbered houses in its medieval center and a vibrant student population.",
        "The Parliament of Brittany building survived a major fire in 1994 and was meticulously restored."
      ],
      "fun_fact": [
        "Rennes has France's second-largest student population after Paris.",
        "The city's Saturday market at Place des Lices is one of France's largest."
      ],
      "trivia": [
        "The Parc du Thabor combines French formal gardens, an English landscape garden and a botanical garden.",
        "Rennes was the first city in the world to install a public bike-sharing system in 1998."
      ]
    },
    {
      "city": "Grenoble",
      "country": "France",
      "clues": [
        "This Alpine city hosted the 1968 Winter Olympics and is surrounded by three mountain ranges.",
        "It's a major scientific center with Europe's largest synchrotron facility."
      ],
      "fun_fact": [
        "The Bastille fort overlooking the city is accessible by 'bubble' cable cars.",
        "Grenoble has the shortest funicular in the world at just 33 meters long."
      ],
      "trivia": [
        "The city was a center of resistance during WWII due to its mountainous terrain.",
        "Grenoble's microelectronics industry earned it the nickname 'Capital of the Alps.'"
      ]
    },
    {
      "city": "Dijon",
      "country": "France",
      "clues": [
        "This Burgundian city is famous for its mustard and as a wine capital.",
        "Its owl sculpture on Notre Dame church is said to grant wishes when touched with the left hand."
      ],
      "fun_fact": [
        "Dijon was the capital of the Duchy of Burgundy when it rivaled royal France in wealth and power.",
        "The city's international gastronomy fair has been held annually since 1921."
      ],
      "trivia": [
        "The Palace of the Dukes now houses the city hall and a museum with medieval tombs.",
        "Dijon's historic center has 97 hectares of protected heritage buildings."
      ]
    },
    {
      "city": "Aix-en-Provence",
      "country": "France",
      "clues": [
        "This elegant Provençal city was home to painter Paul Cézanne and has numerous fountains.",
        "Its Cours Mirabeau is one of France's most beautiful avenues, lined with plane trees and cafés."
      ],
      "fun_fact": [
        "Aix was the capital of Provence until the French Revolution.",
        "The city has over 1,000 fountains, earning it the nickname 'City of a Thousand Fountains.'"
      ],
      "trivia": [
        "Montagne Sainte-Victoire, frequently painted by Cézanne, dominates the landscape east of the city.",
        "Aix's summer music festival is one of France's oldest and most prestigious."
      ]
    },
    {
      "city": "Toulon",
      "country": "France",
      "clues": [
        "This Mediterranean naval port is home to France's largest naval base.",
        "Nearby Mont Faron offers panoramic views accessible by cable car."
      ],
      "fun_fact": [
        "Toulon's harbor is one of Europe's finest natural harbors, protected by mountains.",
        "The city was liberated by Free French and Allied forces in 1944 after being occupied by Germany."
      ],
      "trivia": [
        "The Mourillon district has sandy beaches rare on this rocky coast.",
        "Toulon's opera house is one of France's oldest, built in 1862."
      ]
    },
    {
      "city": "Brest",
      "country": "France",
      "clues": [
        "This Breton port city was almost completely rebuilt after WWII destruction.",
        "Its castle houses the National Navy Museum and offers views of the harbor."
      ],
      "fun_fact": [
        "Brest has one of Europe's largest artificial harbors.",
        "The city's Oceanopolis is France's largest aquarium with three polar, tropical and temperate ecosystems."
      ],
      "trivia": [
        "The Recouvrance bridge is Europe's largest vertical-lift bridge.",
        "Brest hosts an international maritime festival every four years with tall ships from around the world."
      ]
    },
    {
      "city": "Le Havre",
      "country": "France",
      "clues": [
        "This rebuilt port city is a UNESCO site for its modernist architecture by Auguste Perret.",
        "Its concrete cathedral has a 107-meter tower visible from the sea."
      ],
      "fun_fact": [
        "Le Havre was France's first registered UNESCO site for 20th century architecture.",
        "The city was founded in 1517 by King Francis I as a new royal port."
      ],
      "trivia": [
        "The Musée Malraux has France's second-largest collection of impressionist paintings after Paris.",
        "Le Havre's beach was France's first seaside resort in the 19th century."
      ]
    },
    {
      "city": "Reims",
      "country": "France",
      "clues": [
        "This Champagne capital is where French kings were crowned for over 1,000 years.",
        "Its Gothic cathedral was where Charles de Gaulle and Konrad Adenauer reconciled France and Germany in 1962."
      ],
      "fun_fact": [
        "The city's underground chalk tunnels contain millions of bottles of aging champagne.",
        "Reims was 80% destroyed in WWI but meticulously rebuilt in the 1920s."
      ],
      "trivia": [
        "The surrender of Nazi Germany was signed here on May 7, 1945.",
        "Taittinger and Pommery champagne houses offer tours of their historic cellars."
      ]
    },
    {
      "city": "Le Mans",
      "country": "France",
      "clues": [
        "This city hosts the world's oldest active endurance car race, the 24 Hours of Le Mans.",
        "Its medieval old town has well-preserved Roman walls and a Gothic cathedral."
      ],
      "fun_fact": [
        "The 24-hour race began in 1923 on a circuit combining racetrack and public roads.",
        "Le Mans was the birthplace of Henry II, first Plantagenet king of England."
      ],
      "trivia": [
        "The city's Roman walls are among the best preserved in northern France.",
        "Le Mans' tram system uses innovative ground-level power supply without overhead lines."
      ]
    },
    {
      "city": "Clermont-Ferrand",
      "country": "France",
      "clues": [
        "This Auvergne city is built on an ancient volcano and is home to tire manufacturer Michelin.",
        "The black Gothic cathedral was built from volcanic stone."
      ],
      "fun_fact": [
        "The Puy de Dôme volcano overlooking the city was used by Blaise Pascal for barometric experiments.",
        "Clermont-Ferrand hosts the International Short Film Festival, one of the world's most prestigious."
      ],
      "trivia": [
        "The city was where Pope Urban II preached the First Crusade in 1095.",
        "Vulcania theme park explores volcanology with interactive exhibits and simulations."
      ]
    },
    {
      "city": "Amiens",
      "country": "France",
      "clues": [
        "This Picardy city has France's largest Gothic cathedral, twice the volume of Notre-Dame de Paris.",
        "Its floating market gardens called 'hortillonnages' can be explored by boat."
      ],
      "fun_fact": [
        "The cathedral's labyrinth was used for penitential walks on one's knees.",
        "Amiens was the hometown of Jules Verne, who served on the city council for 15 years."
      ],
      "trivia": [
        "The city was a major textile center known for its velvet in the Middle Ages.",
        "Amiens' Christmas market features the largest light show in northern France."
      ]
    },
    {
      "city": "Tours",
      "country": "France",
      "clues": [
        "This Loire Valley city is the gateway to châteaux country and known for its pure French accent.",
        "Its Saint-Gatien cathedral combines Gothic and Renaissance styles."
      ],
      "fun_fact": [
        "Tours was a major pilgrimage site as the burial place of Saint Martin, one of France's patron saints.",
        "The city was the capital of France briefly during WWII as the government fled Paris."
      ],
      "trivia": [
        "The Place Plumereau has perfectly preserved medieval half-timbered houses.",
        "Tours is at the center of France's largest white wine region."
      ]
    },
    {
      "city": "Limoges",
      "country": "France",
      "clues": [
        "This central French city is world-famous for its porcelain, using local kaolin clay.",
        "Its medieval bishops' district has timber-framed houses and underground crypts."
      ],
      "fun_fact": [
        "Limoges porcelain was so prized that it became known as 'white gold.'",
        "The city's enamel work from the Middle Ages is considered some of Europe's finest."
      ],
      "trivia": [
        "The Adrien Dubouché National Museum has over 12,000 pieces of ceramics and glass.",
        "Limoges was an important stop on the pilgrimage route to Santiago de Compostela."
      ]
    },
    {
      "city": "Metz",
      "country": "France",
      "clues": [
        "This Lorraine city has a Gothic cathedral with the largest surface area of stained glass in France.",
        "Its Pompidou Center-Metz is a satellite of the famous Paris modern art museum."
      ],
      "fun_fact": [
        "The cathedral's windows include works by Marc Chagall.",
        "Metz was part of Germany from 1871-1918 and has Germanic architectural influences."
      ],
      "trivia": [
        "The city's train station was built when Metz was German and resembles a medieval castle.",
        "Metz has over 480 hectares of parks and gardens, earning it the nickname 'Green City."
      ]
    }
  ]
